Revit 2027 API
AnalyticalMember.IsValidSectionTypeId Method
 Checks whether the family symbol id is allowed for Analytical Member as Section Type property.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSectionTypeId(
	ElementId familySymbolId
)
Public Function IsValidSectionTypeId (
	familySymbolId As ElementId
) As Boolean
public:
bool IsValidSectionTypeId(
	ElementId^ familySymbolId
)
member IsValidSectionTypeId :
        familySymbolId : ElementId -> bool
Parameters
familySymbolId ElementId
 Family symbol id which has to be checked.
Return Value
Boolean
 True if %familySymbolId% is invalidElementId; or if it is the id of a FamilySymbol of category "Structural Framing" (OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns) Returns false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace